/*
 * 
문제

동현이는 카이스트 대표 체스 선수이다. 기존의 체스 게임이 너무 쉬운 나머지 새로운 체스 말을 만들려고 한다. 
이 말을 new night라고 정의하자.
이 말은 자신의 위치에서 왼쪽, 오른쪽, 왼쪽 대각선 위, 오른쪽 대각선 위 이렇게 총 네 가지 위치로 갈 수 있다.
N*M 격자로 이루어진 맵과 장애물 (말을 놓을 수 없는 위치) 가 주어졌을 때, newnight을 최대로 많이 두고 싶어한다.
동현이는 최근에 술을 너무 많이 마셔 문제를 풀 수 없는 상태이다. 우리가 취한 동현이를 도와주자.

image1

위 그림처럼 newnight는 자신의 위치에서 A,D,E,C를 갈 수 있다. 
“한 번의 이동” 으로 닿을 수 없게 newnight를 최대로 많이 두고 싶다.

입력
입력의 첫 줄에는 테스트케이스의 개수 C가 주어진다. 각각의 테스트 케이스는 아래와 같이 두 부분으로 이루어진다. (1<= C <= 1000)
첫 번째 부분에서는 맵의 세로길이 N과 가로길이 M이 한 줄에 주어진다. (1 ≤ M ≤ 10, 1 ≤ N ≤ 10)
두 번째 부분에서는 정확하게 N줄이 주어진다. 그리고 각 줄은 M개의 문자로 이루어져있다. 
모든 문자는 ‘.’(놓을 수 있는 자리) 또는 ‘x’(놓을 수 없는 자리, 소문자)로 구성된다.

출력
각각의 테스트 케이스에 대해 맵에서 둘 수 있는 최대 newnight의 수를 출력한다.

입력 예제
4
2 3
...
...
2 3
x.x
xxx
2 3
x.x
x.x
10 10
....x.....
..........
..........
..x.......
..........
x...x.x...
.........x
...x......
........x.
.x...x....


출력 예제
4
1
2
46

Solution
- 시간복잡도 ( N * M * 2^M ) : 
- state 는 놓을 수 있다, 없다 상태
- D[i][j][state]
- 하단부터 놓아서 위의 상태를 체크한다.


 */
public class NewKnight_20160920 {

}
